<?php
return
    [
        // ========================Layouts======================= //
        // Navbar
        'notifications' => 'الاشعارات',
        'newRequest' => 'طالب جديد',
        'acceptOffer' => 'تم قبول عرض سعر ',
        'declineOffer' => 'تم رفض عرض سعر ',

        // Sidebar && Name Of Pages
        'home' => 'الصفحة الرئيسية',
        'requests' => 'الطلبات',
        'viewRequest' => 'عرض الطلبات',
        'users' => 'المستخدمين',
        'createUser' => 'إنشاء مستخدم',
        'chats' => 'الدردشة',
        'logout' => 'خروج',
        'create' => 'إنشاء',
        'dashboard' => 'لوحة المعلومات ',

        // ========================Blades========================= //
        // Profile
        'deleteAcc' => 'حذف الحساب',
        'oneceDelete' => 'بمجرد حذف حسابك، سيتم حذف جميع موارده وبياناته نهائيًا. قبل حذف حسابك، يرجى تنزيل أي بيانات أو معلومات ترغب في الاحتفاظ بها.',
        'sureDelete' => 'هل انت متأكد انك تريد حذف حسابك؟',
        'password' => 'رقم السري',
        'updatePass' => 'تغير كلمة السر',
        'ensurePass' => 'تأكد من أن حسابك يستخدم كلمة مرور طويلة وعشوائية ليظل آمنًا.',
        'currentPassword' => 'كلمة السر الحالية',
        'newPassword' => 'كلمة المرور الجديدة',
        'confirmPassword' => 'تأكيد كلمة المرور',
        'profileInfo' => 'معلومات الملف الشخصي',
        'updateAcc' => '.قم بتحديث معلومات الملف الشخصي وعنوان البريد الإلكتروني الخاص بحسابك.',
        'yourEmail' => '.لم يتم التحقق من عنوان بريدك الإلكتروني',
        'sendCode' => '.انقر هنا لإعادة إرسال رسالة التحقق عبر البريد الإلكتروني.',
        'newCodeSend' => '.تم إرسال رابط تحقق جديد إلى عنوان بريدك الإلكتروني.',

        // Home Page
        'totalRequests' => 'جميع الطلبات',
        'pendingRequests' => 'الطلبات قيد الانتظار',
        'activeRequests' => 'الطلبات قيد العمل',
        'finishedRequest' => 'الطلبات المنتهية',
        'declineRequests' => 'الطلبات المرفوضة',
        'totalUsers' => 'جميع المستخدمين',

        //Requests Page
        'all' => 'جميع',
        'pending' => 'قيد الانتظار',
        'inprocess' => 'قيد الاجراء',
        'inprogress' => 'قيد العمل ',
        'declined' => 'مرفوضة',
        'finished' => 'منتهية',
        'completed' => 'اكتملت',
        'orderId' => 'رقم الطلب',
        'numberCars' => 'عداد السيارات',
        'status' => 'الحالة',
        'totalCars' => 'عداد السيارات',

        // View Request
        'factory' => 'مصنع',
        'modelYear' => 'موديل - سنة الصنع',
        'vin' => 'رقم تعريفي ',
        'plate' => 'رقم لوحة',
        'km' => 'كيلومتر',
        'place' => 'المكان',
        'problem' => 'المشكلة',
        'response' => 'الرد',
        'remark' => 'ملاحظة',
        'actions' => 'فعل',
        'block' => 'حذر',
        'activate' => 'تفعيل',
        'request' => 'الطلب',
        'requestDetails' => 'تفاصيل الطلب',

        // Offer Prices
        'offerPrice' => 'عرض سعر',

        // View Offer Prices
        'userInfo' => 'معلومات المستخدم',

        // Table Users
        'usertype' => 'نوع المستخدم',
        'employees' => 'موظفين',
        'employee' => 'موظف',

        //Create Account
        'governmental' => 'جهة حكومية',
        'adminGovernmental' => 'مسؤل جهة حكومية',
        'company' => 'شركة',

        // Chats
        'conversationEmpty' => '"مرحبًا! 👋 حاليًا، لا توجد رسائل جديدة. لا تتردد في بدء محادثة أو طرح أي سؤال تود طرحه. أنا هنا للدردشة والمساعدة!"',
        'conversationSelect' => 'لم يتم تحديد أي محادثة',
        'all' => 'الجميع',
        'latest' => 'اخرالمحدثات',
        'photos' => 'صور',
        'files' => 'ملفات',
        'typeMessage' => 'اكتب هنا',

        // Create Offer Price
        "createOffer" => 'انشاء عرض',
        "addRow" => "إضافة صف",
        "totalQuantity" => "الكمية الإجمالية",
        "All" => "كل",

        //PDF
        'commercialRegister' => 'السجل التجاري',
        'taxNumber' => 'الرقم الضريبي',
        'numberOfStatement' => 'عدد البيان',
        'adminName' => 'اسم المسؤول',
        'companyName' => 'اسم الشركة',
        'createdAt' => 'تاريخ الإنشاء',
        'dueTo' => 'المستحق لـ',
        'address' => 'العنوان',
        'description' => 'الوصف',
        'price' => 'السعر',
        'sale' => 'التخفيض',
        'total' => 'المجموع',
        'services' => 'الخدمات',
        'spareParts' => 'قطع الغيار',
        'quantity' => 'الكمية',
        'totalPrice' => 'السعر الإجمالي',
        'sar' => 'ر.س',
        'address' => 'عنوان',
        'carType' => 'نوع السيارة',
        'carModel' => 'الموديل',
        'plateLatters' => 'الحروف',
        'plateNumbers' => 'الأرقام',
        'affiliatedCenter' => 'المركز التابع له',

        'sequence' => 'التسلسل',
        'services_maintenance' => 'الخدمات والصيانة',
        'unit' => 'الوحدة',
        'vehicleReceiptCenter' => 'بيانات مستلم المركبة من المركز التابع',
        'signature' => 'التوقيع',
        'pdfTitle' => 'تم الانتهاء من إنجاز أعمال الصيانة وهي كالتالي:',
        'phoneNumber' => 'رقم الهاتف',
        'technicalMembers' => 'الأعضاء الفنين',
        'accreditationApproval' => 'اعتماد وموافقة مدير الورشة',


        // ==========================Title========================= //
        // Titles Lables
        'name' => 'الاسم',
        'email' => 'بريد إلكتروني',
        'phone' => 'الهاتف',
        'type' => 'الوظيفة',
        'password' => 'كلمة المرور',
        'password_confirmation' => 'تأكيد كلمة المرور',
        'search' => 'بحث',
        'date' => 'التاريخ',
        'profile' => 'حساب ',
        'generateMsg' => 'كم عدد السيارات التي تريد تقديم الخدمة لها ...',
        'generate' => 'توليد',
        'number' => 'رقم',
        'time' => 'توقيت',

        // Messages Show When
        'userCreatedSuccess' => 'تم إنشاء مستخدم  بنجاح',
        'userCreatedError' => '!!..فشل في إنشاء مستخدم',
        'userUpdatedSuccess' => 'تم تعديل بينات المستخدم  بنجاح',
        'userUpdatedError' => '!!..فشل في تعديل بينات مستخدم.',

        'noRecords' => 'لم يتم العثور على سجلات',
        'noRequest' => 'لم يتم العثور على طلبات',
        'noNotificaions' => 'لم يتم العثور على اشعارات',
        'noOfferPrice' => 'لم يتم العثور على سعر العرض',
        'noRemarks' => 'لم تتم اختيار ملاحظات ..',
        'noDeclines' => 'لم يتم العثور على اسباب رفض',
        'noChatsSelected' => 'لم تتم اختيار محادثات بعد..',
        'invoiceSave' => 'تم حفظ سعر العرض بنجاح!',
        'sparePartSave' => 'تم حفظ قطع الغيار بنجاح!',
        'enterNumberOfCars' =>  'أدخل إجمالي عدد السيارات',
        'conversationEmpty' => 'مرحبًا! 👋 حاليًا، لا توجد رسائل جديدة. لا تتردد في بدء محادثة أو طرح أي استفسار ترغب في ذلك. أنا هنا للدردشة والمساعدة!',
        'conversationSelect' => 'لم يتم اختيار محادثة بعد',
        'heyMessage' => 'مرحبًا بك في شركة الخضراء السعودية! 👋 ليس لديك أي طلبات بعد. يمكنك تقديم طلب عن طريق النقر على زر "إنشاء" وتحديد عدد السيارات التي ترغب في إدراج البيانات لها. بمجرد تقديم الطلب، سيظهر هنا. شكرا لك! 🌟',
        'heyMessageAdmin' => 'مرحبًا بك في شركة الخضراء السعودية! 👋 ليس لديك أي طلبات بعد. يمكنك إنشاء مستخدمين، وعندما يقدم أي مستخدم طلبًا، سيظهر هنا. يمكنك إنشاء مستخدم عن طريق النقر على "إنشاء مستخدم" في الشريط الجانبي. 🌟',

        'confirmDelete' => 'هل أنت متأكد أنك تريد حذف هذا المنشور؟',
        'errorOccured' => 'عذرًا، حدث خطأ يرجى المحاولة مرة أخرى..',

        'deletedUserSuccess' => 'تم حذف المستخدم بنجاج',
        'blockUserSuccess' => 'تم حذر المستخدم بنجاج',
        'activateUserSuccess' => 'تم تفعيل المستخدم بنجاج',

        'sureDeleteR' => 'هل أنت متأكد أنك تريد حذف هذا الطلب؟',
        'sureBlockU' => 'هل أنت متأكد أنك تريد حظر هذا المستخدم؟',
        'sureDeleteU' => 'هل أنت متأكد من حذف هذا المستخدم؟',
        'sureActivateU' => 'هل أنت متأكد من تفعيل هذا المستخدم؟',

        // Comman Titles
        'admin' => 'مسؤل',
        'Admins' => 'مسؤلين',
        'users' => 'مستخدمين',
        'customer' => 'عميل',
        'clients' => 'عملاء',
        'company' => 'شركة',
        'govermental' => 'جهة حكومية',
        'messages' => 'الرسائل',
        'yourEmail' => 'ادخل البريد الاكتروني الخاص بك',
        'yourPhone' => 'ادخل رقم الهاتف الخاص بك',
        'typeHere' => 'اكتب هنا',

        // ==========================Buttons======================== //
        'accept' => 'قبول',
        'decline' => 'رفض',
        'finish' => 'انتهاء',
        'contact' => 'تواصل',

        'view' => 'عرض',
        'save' => 'حفظ',
        'edit' => 'تعديل',
        'update' => 'تحديث',

        'print' => 'طباعة',
        'download' => 'تنزيل',

        'cancel' => 'الغاء',
        'back' => 'رجوع',
        'delete' => 'حذف',
        'signIn' => 'تسجيل الدخول',
        'getStarted' => 'ابداء',
        'undo' => 'الغاء',

        'conversations' => 'المحادثات',
        'archived' => 'مؤرشف',
        'archive' => 'أرشيف',
        'unarchives' => 'غير أرشيف',

        'newOffer' => 'عرض السعر جديد',
        'offerAccept' => 'تم قبول عرض السعر',
        'offerDecline' => 'تم رفض عرض السعر',

        'inquiries' => 'استفسارات',
        'message' => 'رسالة',
        'inquireId' => 'رقم استفسار',
        'achievements' => 'الانجازات',

        'numberOfCars' => 'عداد السيارات',
        'requestID' => 'رقم الطالب',
        'offerPrices' => 'عرض السعر',

        'sureAcceptOffer' => 'هل أنت متأكد من قبول العرض؟',
        'sureDeclineOffer' => 'هل أنت متأكد من رفض العرض؟',
        'noAchievementsScene' => 'لا يوجد مشاهد انجاز',
        'noInquires' => 'لا يوجد استفسارات',

        'remarks' => 'ملاحظات',
        'editUser' => 'تعديل مستخدم',

        'overview' => 'نظرة عامة',
        'members' => 'أعضاء',
        'requestUnseen' => 'طلبات لم يتم مشاهدته',


        'requestProcess' => 'الطلب قيد الاجراء',
        'requestProgress' => 'الطلب قيد العمل',
        'requestDeclined' => 'تم رفض الطلب',
        'requestFinished' => 'انتهى الطلب',
        'requestCompleted' => 'اكتمل الطلب',

        'activate' => 'تفعيل',
        'checkYourOfferPrice' => 'تحقق من عرض السعر',
        'offerPriceUploaded' => 'تم رفع عرض السعر',

        'deletedIt' => 'نعم، احذفها!',
        'deleted' => 'تم الحذف!',
        'theRequestDeleted' => 'تم حذف الطلب بنجاح.',
        'theOfferPriceDeleted' => 'تم حذف الطلب عرض السعر.',
        'file' => 'ملف',
        "completed_confirmation" => "هل أنت متأكد من أنك ترغب في إتمام الطلب؟",
        'action' => 'Action',
        'confirm' => 'تاكيد',
        'tasks' => 'مهام',
        'reasonTitle' => 'سبب الرفض',
        'reasonTyping' => 'اكتب رسالتك هنا..',
        'emptyReason' => 'الرسالة مطلوبة لرفض سعر العرض.',
        'sar' => 'ر.س',

        'requestInprocess' => 'طلب قيد الاجراء',
        'requestDeclined' => 'تم رفض الطلب',
        'requestInProgress' => 'الطلب قيد العمل',
        'requestFinished' => 'انتهاء الطلب',
        'requestCompleted' => 'تم إكمال الطلب',
        'forRequestId' => 'لرقم الطلب',
        'offerNumber' => 'رقم العرض',
        'requestFrom' => 'الطلب من',

        'noCars' => 'عداد السارات',

        'requestCreatedSuccess' => 'تم إنشاء طلبك بنجاح',
        'requestCreatedError' => 'حدث خطأ أثناء إنشاء الطلب',

        'requestUpdatedSuccess' => 'تم تحديث طلبك بنجاح',
        'requestUpdatedError' => 'حدث خطأ أثناء تحديث الطلب',

        'offerCreatedSuccess' => 'تم إنشاء عرض سعر بنجاح',
        'offerCreatedError' => 'حدث خطأ أثناء إنشاء العرض سعر ',

        'offerUpdatedSuccess' => 'تم تحديث عرض سعر بنجاح',
        'offerUpdatedError' => 'حدث خطأ أثناء تحديث عرض سعر ',

        'reasonTitle' => 'سبب الرفض',
        'reasonTyping' => 'اكتب السبب هنا..',

        'deletedIt' => 'نعم، تم حذفه!',
        'activatedIt' => 'نعم، تم تنشيطه!',
        'blockedIt' => 'نعم، تم حظره!',

        'active' => 'نشط',
        'blocked' => 'محظور',

        'carsNumber' => 'يجب ألا يتجاوز الرقم 50.',

        'numberofferPrices' => 'عداد عروض السعر',

        'userDeleted' => 'تم حذف المستخدم.',
        'userBlocked' => 'تم حظر المستخدم.',
        'userActivated' => 'تم تنشيط المستخدم.',

        'deleted' => 'تم الحذف!',
        'activated' => 'تم التفعيل!',
        'blockedd' => 'تم الحظر!',

        'youDeclinedOffer' => 'لقد رفضت سعر العرض',
        'youAcceptedOffer' => 'لقد قبلت سعر العرض',

        'archivesEmpty' => 'لاتوجد ارشيفات ',
        'conversationsEmpty' => 'لا توجد محادثات',
        'usersEmpty' => 'لا يوجد مستخدمون',
    ];
